app/controllers/projects_controller.rb

  def update
    @project = Project.find(params[:id])
    if @project.update(project_params)
---
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "projects" SET "pledging_ends_on" = ?, "updated_at" = ? WHERE "projects"."id" = 1  [["pledging_ends_on", "2015-05-26"], ["updated_at", "2015-05-23 11:24:52.324226"]]

  def create
    @project = Project.new(project_params)
    if @project.save
---
INSERT INTO "projects" ("created_at", "description", "image_file_name", "name", "pledging_ends_on", "target_pledge_amount", "team_members", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)