app/controllers/registrations_controller.rb

  def index
    # @registrations = Registration.all
    @project = Project.find(params[:project_id])
---
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]

  def new
    @project = Project.find(params[:project_id])
---
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @project = Project.find(params[:project_id])
    @registration = @project.registrations.new(registration_params)
    if @registration.save
---
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "registrations" ("created_at", "email", "how_heard", "name", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-05-28 08:13:16.973639"], ["email", "keith@gmail.com"], ["how_heard", "Twitter"], ["name", "Keith"], ["project_id", 2], ["updated_at", "2015-05-28 08:13:16.973639"]]